app/controllers/bike_workouts_controller.rb

SELECT * FROM `workouts` WHERE (`workouts`.`id` = 395 AND (`workouts`.user_id = 1)) AND ( (`workouts`.`type` = 'BikeWorkout' ) )
---
  def edit
    @routes = @current_user.routes.find :all
    @workout = @current_user.bike_workouts.find(params[:id])

SELECT * FROM `routes` WHERE (`routes`.`id` = 0 AND (`routes`.user_id = 1))
---
  def new
    @routes = @current_user.routes.find :all

INSERT INTO `workouts` (`duration`, `created_at`, `notes`, `min_hr`, `avg_hr`, `updated_at`, `max_hr`, `time_of_day`, `user_id`, `type`, `plan_type`, `cals_burned`, `avg_rpms`, `workout_date`, `distance`, `pace`, `route_id`) VALUES('2010-03-17 00:25:00', '2010-03-17 21:20:58', '', 0, 0, '2010-03-17 21:20:58', 0, '2010-03-17 20:00:00', 1, 'BikeWorkout', 'a', 0, 0.0, '2010-03-17', 5.69, 13.55, NULL)
---
  def create
    @bike = @current_user.bike_workouts.build(params[:bike_workout])
    @bike.calbikepace

    if @bike.save

SELECT * FROM `workouts` WHERE (`workouts`.`id` = 395 AND (`workouts`.user_id = 1)) AND ( (`workouts`.`type` = 'BikeWorkout' ) )
UPDATE `users` SET `perishable_token` = 'AIDKAPn9iXXf-9TbOzNr', `last_request_at` = '2010-03-10 20:46:44' WHERE `id` = 1
UPDATE `workouts` SET `updated_at` = '2010-03-10 20:46:44', `notes` = 'Even though it was a nice day, I decided I would ride on the trainer so I could ride with Spring.\r\n\r\nWS: 5\' 4th gear\r\nMS: 40\' 5th gear\r\nCD: 5\' 4th gear' WHERE `id` = 395
---
  def update
    @bike = @current_user.bike_workouts.find(params[:id])
    if @bike.update_attributes(params[:bike_workout])

SELECT * FROM `workouts` WHERE (`workouts`.`id` = 404 AND (`workouts`.user_id = 1)) AND ( (`workouts`.`type` = 'BikeWorkout' ) )
DELETE FROM `workouts` WHERE (`id` IN (404)) AND ( (`workouts`.`type` = 'BikeWorkout' ) )
---
  def destroy
    @bike = @current_user.bike_workouts.find(params[:id])
    @bike.delete