app/controllers/dashboards_controller.rb

  def show
    if params[:type].nil?
      type = 'a'
      first_date = Date.today - Date.today.wday - 20
      last_date = Date.today + (7 - Date.today.wday) + 21
      @user = @current_user
      @swims = @current_user.swim_workouts.find :all, :conditions => ["workout_date >= ? and workout_date <= ? and plan_type = ?",
        first_date, last_date, type], :order => 'workout_date DESC'
---
SELECT duration, distance FROM `workouts` WHERE (`workouts`.user_id = 1 AND (workout_date >= '2010-03-01' and workout_date <= '2010-03-31')) AND ( (`workouts`.`type` = 'SwimWorkout' ) )