app/controllers/routes_controller.rb

  def index
    @routes = @current_user.routes.find :all
---
SELECT * FROM `routes` WHERE (`routes`.user_id = 1)

  def show
    @route = @current_user.routes.find(params[:id])
---
SELECT * FROM `routes` WHERE (`routes`.`id` = 2 AND (`routes`.user_id = 1))

  def edit
    @route = @current_user.routes.find(params[:id])
---
SELECT * FROM `routes` WHERE (`routes`.`id` = 11 AND (`routes`.user_id = 1))

  def create
    @route = @current_user.routes.new
    @route.name = params[:name]
    @route.distance_mi = params[:distMi]
    @route.distance_km = params[:distKm]
    @route.route_type = params[:route_type]
    data_points = Crack::JSON.parse(params[:jsonPoints])

    data_points.each do |data_point|
      @route.route_points.build( :lat => data_point['lat'], :lng => data_point['lng'] )
    end

    if @route.save
---
INSERT INTO `route_points` (`created_at`, `updated_at`, `lng`, `lat`, `route_id`) VALUES('2010-03-09 15:23:53', '2010-03-09 15:23:53', -84, 39, 1)
INSERT INTO `routes` (`name`, `distance_km`, `created_at`, `updated_at`, `distance_mi`, `user_id`, `route_type`) VALUES('Testing', 0.77, '2010-03-09 15:23:46', '2010-03-09 15:23:46', 0.48, 1, 'Run')

  def destroy
    @route = @current_user.routes.find(params[:id])
    @route.destroy
---
SELECT * FROM `routes` WHERE (`routes`.`id` = 1 AND (`routes`.user_id = 1))
DELETE FROM `routes` WHERE `id` = 1