app/controllers/run_workouts_controller.rb

SELECT * FROM `routes` WHERE (`routes`.user_id = 1)
SELECT * FROM `workouts` WHERE (`workouts`.`id` = 400 AND (`workouts`.user_id = 1)) AND ( (`workouts`.`type` = 'RunWorkout' ) )
---
  def edit
    @routes = @current_user.routes.find :all
    @workout = @current_user.run_workouts.find(params[:id])

SELECT * FROM `routes` WHERE (`routes`.user_id = 1)
---
  def new
    @routes = @current_user.routes.find :all

INSERT INTO `workouts` (`duration`, `created_at`, `notes`, `min_hr`, `avg_hr`, `updated_at`, `max_hr`, `time_of_day`, `user_id`, `type`, `plan_type`, `cals_burned`, `avg_rpms`, `workout_date`, `distance`, `pace`) VALUES('2010-03-09 00:37:14', '2010-03-09 18:25:02', 'Good run, cut it a little short because my phone fell off the treadmill. I was going to go for 40min, but oh well.\r\n\r\n5\' - 6.0mph (10:00 pace)\r\n30\' - 6.2 (9:40 pace)\r\n2\'14\" - 5.0mph (12:00 pace)', 0, 163, '2010-03-09 18:25:02', 172, '2010-03-09 17:18:00', 1, 'RunWorkout', 'a', 436, 0.0, '2010-03-09', 3.73, 9.92)
---
  def create
    @run = @current_user.run_workouts.build(params[:run_workout])
    @run.calrunpace

    if @run.save

SELECT * FROM `workouts` WHERE (`workouts`.`id` = 400 AND (`workouts`.user_id = 1)) AND ( (`workouts`.`type` = 'RunWorkout' ) )
UPDATE `users` SET `perishable_token` = 'e-VJy5REPt2INoXSWhWy', `last_request_at` = '2010-03-18 13:35:45' WHERE `id` = 1
UPDATE `workouts` SET `updated_at` = '2010-03-18 13:35:45', `route_id` = 1 WHERE `id` = 400
---
  def update
    @run = @current_user.run_workouts.find(params[:id])
    if @run.update_attributes(params[:run_workout])

SELECT * FROM `workouts` WHERE (`workouts`.`id` = 403 AND (`workouts`.user_id = 1)) AND ( (`workouts`.`type` = 'RunWorkout' ) )
DELETE FROM `workouts` WHERE `id` = 403
---
  def destroy
    @run = @current_user.run_workouts.find(params[:id])
    @run.destroy