app/controllers/swim_workouts_controller.rb

SELECT * FROM `routes` WHERE (`routes`.user_id = 1)
---
  def new
    @routes = @current_user.routes.find :all

INSERT INTO `workouts` (`duration`, `created_at`, `notes`, `min_hr`, `avg_hr`, `updated_at`, `max_hr`, `time_of_day`, `user_id`, `type`, `plan_type`, `cals_burned`, `avg_rpms`, `workout_date`, `distance`, `pace`) VALUES('2010-03-11 00:50:51', '2010-03-11 10:34:14', 'Pretty decent swim today, looking forward to backing off next week and taking it a little easier.\r\n\r\nWS: 1x50 - 1\'17\"\r\nMS: 1x100 - 1\'52\"\r\n 1x200 - 4\'00\"\r\n 1x300 - 5\'55\"\r\n 1x400 - 8\'07\"\r\n 3x100 kicboard - 2\'41\", 2\'40\", 2\'34\"\r\n 1x400 - 8\'16\"\r\n 1x300 - 6\'09\"\r\n 1x200 - 4\'04\"\r\n 1x100 - 1\'59\"\r\nCD: 1x50 - 1\'17\"\r\n\r\nTotal Time: 58\'02\"', 0, 0, '2010-03-11 10:34:14', 0, '2010-03-11 08:20:00', 1, 'SwimWorkout', 'a', 0, 0.0, '2010-03-11', 2400.0, 2.08)
---
  def create
    @swim = @current_user.swim_workouts.build(params[:swim_workout])
    @swim.calswimpace

    if @swim.save

SELECT * FROM `workouts` WHERE (`workouts`.`id` = 402 AND (`workouts`.user_id = 1)) AND ( (`workouts`.`type` = 'SwimWorkout' ) )
DELETE FROM `workouts` WHERE `id` = 402
---
  def destroy
    @swim = @current_user.swim_workouts.find(params[:id])
    @swim.destroy